eisup_2019_docmng_integration/src/DocumentJournals/абс_ДокументыППД/абс_ДокументыППД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>абс_ДокументыППД</name>
  <registeredDocuments>Document.АвансовыйОтчет</registeredDocuments>
  <registeredDocuments>Document.АктОбОказанииПроизводственныхУслуг</registeredDocuments>
  <registeredDocuments>Document.ТребованиеНакладная</registeredDocuments>
  <registeredDocuments>Document.ПередачаТоваров</registeredDocuments>
  <registeredDocuments>Document.ПеремещениеТоваров</registeredDocuments>
  <registeredDocuments>Document.ПоступлениеТоваровУслуг</registeredDocuments>
  <registeredDocuments>Document.РеализацияТоваровУслуг</registeredDocuments>
  <registeredDocuments>Document.КомплектацияНоменклатуры</registeredDocuments>
  <registeredDocuments>Document.ПолучениеУслугПоПереработке</registeredDocuments>
  <registeredDocuments>Document.СписаниеТоваров</registeredDocuments>
  <registeredDocuments>Document.КорректировкаПоступления</registeredDocuments>
  <registeredDocuments>Document.КорректировкаРеализации</registeredDocuments>
  <registeredDocuments>Document.ВозвратПереданныхТоваров</registeredDocuments>
  <columns>
    <name>Статус</name>
  </columns>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Контрагент</name>
  </columns>
  <columns>
    <name>Ответственный</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
  <columns>
    <name>ОтветственныйБухгалтер</name>
  </columns>
</mdclass:DocumentJournal>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПервичныхДокументов/абс_СтатусыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПервичныхДокументов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПринятыБухгалтером</name>
    <comment>Обработка принятых документов (до оптимизации 2018)</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>УточнениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УточнениеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДокумента</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Источник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Приемник</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДиректоромДирекции</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
    <comment>Департамент казначейства</comment>
  </enumValues>
  <enumValues>
    <name>СогласованиеОЭФ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомКЦ</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДД</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеИспользуется</name>
      <description>_Не используется</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодрядаНеИСП</name>
      <description>(Не исп.) Согласование договоров подряда</description>
    </items>
    <items>
      <name>Бухгалтерия</name>
      <description>Бухгалтерия</description>
    </items>
    <items>
      <name>ДФМ</name>
      <description>ДФМ</description>
    </items>
    <items>
      <name>НастройкаПрав</name>
      <description>Настройка прав</description>
    </items>
    <items>
      <name>НачислениеРНПД</name>
      <description>Начисление РНПД</description>
    </items>
    <items>
      <name>ОбщиеРоли</name>
      <description>Общие роли</description>
    </items>
    <items>
      <name>Поддержка</name>
      <description>Поддержка</description>
    </items>
    <items>
      <name>ПроектныйУчет</name>
      <description>Проектный учет</description>
    </items>
    <items>
      <name>РаботаСДоговорами</name>
      <description>Работа с договорами</description>
    </items>
    <items>
      <name>РолиИСУЗК</name>
      <description>Роли ИСУЗК</description>
    </items>
    <items>
      <name>СогласованиеАктовПриёмкиВыполненныхРабот</name>
      <description>Согласование актов приёмки выполненных работ</description>
    </items>
    <items>
      <name>СогласованиеБюджета</name>
      <description>Согласование бюджета</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодряда</name>
      <description>Согласование договоров подряда</description>
    </items>
    <items>
      <name>ЗакупочныеЗаказыСчета</name>
      <description>Согласование закупочных заказов и счетов</description>
    </items>
    <items>
      <name>СогласованиеЗаявокНаОбеспечениеТМЦ</name>
      <description>Согласование заявок на обеспечение ТМЦ</description>
    </items>
    <items>
      <name>СогласованиеОС</name>
      <description>Согласование ОС</description>
    </items>
    <items>
      <name>ttk_Аудитор</name>
      <description>Аудитор</description>
    </items>
    <items>
      <name>БюджетныйКонтролер</name>
      <description>Бюджетный контролер</description>
    </items>
    <items>
      <name>ttk_ВалютныйКонтроль</name>
      <description>Валютный контроль</description>
    </items>
    <items>
      <name>ВводКЗР</name>
      <description>Ввод КЗР</description>
    </items>
    <items>
      <name>ВводОперацияБУНУ</name>
      <description>Ввод операция БУНУ</description>
    </items>
    <items>
      <name>УстановкаСоответствияАналитикВыручки</name>
      <description>Ввод соответствий аналитик выручки</description>
    </items>
    <items>
      <name>ДирККР</name>
      <description>Дир ККР</description>
    </items>
    <items>
      <name>ДирККРвКТТК</name>
      <description>Дир ККР в КТТК</description>
    </items>
    <items>
      <name>ttk_РуководительБП</name>
      <description>Начальник бюджетного планирования</description>
    </items>
    <items>
      <name>ОтказПоАвизо</name>
      <description>Отказ по авизо</description>
    </items>
    <items>
      <name>ОткрытиеДокументаИнтеграцияСHyperion</name>
      <description>Открытие и работа с документом Интеграция с hyperion</description>
    </items>
    <items>
      <name>ОформлениеАВЗ</name>
      <description>Оформление АВЗ</description>
    </items>
    <items>
      <name>Переутверждение</name>
      <description>Переутверждение</description>
    </items>
    <items>
      <name>ПроведениеППДБезКонтроляМаппинга</name>
      <description>Проведение ППД без контроля маппинга</description>
    </items>
    <items>
      <name>РедактированиеДатыРасходаЗРС</name>
      <description>Редактирование даты расхода ЗРС</description>
    </items>
    <items>
      <name>РедактированиеППДБезКонтроляДатыЗапрета</name>
      <description>Редактирование ППД без контроля даты запрета</description>
    </items>
    <items>
      <name>ttk_РуководительДБО</name>
      <description>Руководитель департамента бюджетирования и отчетности</description>
    </items>
    <items>
      <name>РуководительДК</name>
      <description>Руководитель ДК</description>
    </items>
    <items>
      <name>РуководительПД</name>
      <description>Руководитель ПД</description>
    </items>
    <items>
      <name>СогласованиеДИБ</name>
      <description>Согласование ДИБ</description>
    </items>
    <items>
      <name>СогласованиеДРСД</name>
      <description>Согласование ДРСД</description>
    </items>
    <items>
      <name>СогласованиеДРУ</name>
      <description>Согласование ДРУ</description>
    </items>
    <items>
      <name>СогласованиеДУП</name>
      <description>Согласование ДУП</description>
    </items>
    <items>
      <name>СогласованиеДЭБ</name>
      <description>Согласование ДЭБ</description>
    </items>
    <items>
      <name>ttk_СогласованиеЗакупкиМКР</name>
      <description>Согласование Закупки МКР</description>
    </items>
    <items>
      <name>СогласованиеКонтрагентовЮристами</name>
      <description>Согласование контрагентов юристами</description>
    </items>
    <items>
      <name>СогласованиеКТТК</name>
      <description>Согласование КТТК (филиалы)</description>
    </items>
    <items>
      <name>СогласованиеПД</name>
      <description>Согласование ПД</description>
    </items>
    <items>
      <name>СогласованиеПЛ</name>
      <description>Согласование Первым лицом</description>
    </items>
    <items>
      <name>СогласованиеРекласификацииБюджетаДЭИ</name>
      <description>Согласование рекласификации бюджета (ДЭИ)</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДКП</name>
      <description>Согласование руководителя ДКП</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДОП</name>
      <description>Согласование руководителя ДОП</description>
    </items>
    <items>
      <name>СогласованиеСОКДЭБ</name>
      <description>Согласование СОК (ДЭБ)</description>
    </items>
    <items>
      <name>СогласованиеДВКУР</name>
      <description>Согласование ЦОЗД КТТК</description>
    </items>
    <items>
      <name>ttk_СогласованиеЦФК</name>
      <description>Согласование ЦФК</description>
    </items>
    <items>
      <name>СотрудникГруппыНСИ</name>
      <description>Сотрудник группы НСИ</description>
    </items>
    <items>
      <name>СотрудникДК</name>
      <description>Сотрудник ДК</description>
    </items>
    <items>
      <name>СотрудникСклада</name>
      <description>Сотрудник склада</description>
    </items>
    <items>
      <name>СуперПользователь</name>
      <description>Супер пользователь</description>
    </items>
    <items>
      <name>СуперПользовательДЗО</name>
      <description>Супер пользователь ДЗО</description>
    </items>
    <items>
      <name>ТипКонтрагентаМСФО</name>
      <description>Тип контрагента (МСФО)</description>
    </items>
    <items>
      <name>абс_ТрансфертноеЦенообразование</name>
      <description>Трансфертное ценообразование</description>
    </items>
    <items>
      <name>УстановкаПроектаСтатьи</name>
      <description>Установка проекта статьи</description>
    </items>
  </predefined>
  <attributes>
    <name>абс_РольИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/DocumentJournals/абс_ДокументыППД/Forms/абс_ФормаСпискаУпр/Module.bsl
&НаСервере
Функция ПолучитьТипыБезСогласованияОФК() Экспорт
	
	МассивТиповБезСогласованияОФК = Новый Массив();
	
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументСсылка.ПеремещениеТоваров"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументОбъект.ПеремещениеТоваров"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументСсылка.ПередачаТоваров"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументОбъект.ПередачаТоваров"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументСсылка.КомплектацияНоменклатуры"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументОбъект.КомплектацияНоменклатуры"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументОбъект.РеализацияТоваровУслуг"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументОбъект.АктОбОказанииПроизводственныхУслуг"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	МассивТиповБезСогласованияОФК.Добавить(Тип("ДокументОбъект.КорректировкаРеализации"));	
	
	Возврат МассивТиповБезСогласованияОФК;
	
КонецФункции

&НаКлиенте
Процедура СменитьСтатус()
	
	СтрокаСтатуса = Неопределено;
	Отказ = Ложь;
	СписокДокументов = Новый СписокЗначений;
	ТипДок = Неопределено;
	
	ВклСогласование = Ложь;
	
	
	ПолучитьСписокДокументов(СписокДокументов, ВклСогласование);	
	
	СписокДоступныхСтатусов = Новый СписокЗначений; 
	ЗаполнитьСписокДоступныхСтатусов(СписокДокументов[0].Значение,СписокДоступныхСтатусов,ВклСогласование);
	
	ФормаВыбораСтатуса = ПолучитьОбщуюФорму("ФормаГрупповогоВыбораСтатуса");	
	ФормаВыбораСтатуса.ЭлементыФормы.ВыбСтатус.СписокВыбора = СписокДоступныхСтатусов;
	ФормаВыбораСтатуса.ЭлементыФормы.ВыбСтатус.Значение 	= СтрокаСтатуса;	
	ФормаВыбораСтатуса.СписокПервичныхДокументов.ЗагрузитьЗначения(СписокДокументов.ВыгрузитьЗначения());
	
	РезультатВыбораСтатуса = ФормаВыбораСтатуса.ОткрытьМодально();	
	Если РезультатВыбораСтатуса = Неопределено 
		или РезультатВыбораСтатуса.СписокДокументов.Количество() = 0  
		или РезультатВыбораСтатуса.НовыйСтатус = СтрокаСтатуса Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСтатусСпискаДокументов(РезультатВыбораСтатуса.СписокДокументов
									,Неопределено//РезультатВыбораСтатуса.ПричинаСменыСтатуса
									,РезультатВыбораСтатуса.НовыйСтатус);	
	
КонецПроцедуры   

&НаСервере
Процедура ПолучитьСписокДокументов(СписокДокументов, ВклСогласование)
	
	МассивТиповБезСогласованияОФК = ПолучитьТипыБезСогласованияОФК();
	ТаблицаВр = Новый ТаблицаЗначений;
	ТаблицаВр.Колонки.Добавить("Статус",Новый ОписаниеТипов("ПеречислениеСсылка.абс_СтатусыПервичныхДокументов"));
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл  		
		Док = ВыделеннаяСтрока.Ссылка;
		СтатусДока = ?(ТипЗнч(Док) = Тип("ДокументСсылка.КорректировкаПоступления")
						или ТипЗнч(Док) = Тип("ДокументСсылка.КорректировкаРеализации"),Док.абс_СтатусДокумента,Док.абс_Статус);				
		Строка = ТаблицаВр.Добавить();
		Строка.Статус = СтатусДока;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Список.Статус КАК Статус
	               |ПОМЕСТИТЬ ВР
	               |ИЗ
	               |	&Список КАК Список
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Статус
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ВР.Статус КАК Статус,
	               |	КОЛИЧЕСТВО(ВР.Статус) КАК Статус1
	               |ИЗ
	               |	ВР КАК ВР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВР.Статус
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Статус1 УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВР";
	Запрос.УстановитьПараметр("Список",ТаблицаВр);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если ЗначениеЗаполнено(?(Результат.Статус=null,0,Результат.Статус)) Тогда
		БольшеВсегоСтатусов = Результат.Статус;
	Иначе
		Сообщить("Не найден приоритетный статус!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		Док = ВыделеннаяСтрока.Ссылка;
		СтатусДока = ?(ТипЗнч(Док) = Тип("ДокументСсылка.КорректировкаПоступления")
						или ТипЗнч(Док) = Тип("ДокументСсылка.КорректировкаРеализации"),Док.абс_СтатусДокумента,Док.абс_Статус);
		
		Если БольшеВсегоСтатусов = СтатусДока и не Док.ПометкаУдаления Тогда
			СписокДокументов.Добавить(Док);
			ВклСогласование = ВклСогласование или не ЗначениеЗаполнено(МассивТиповБезСогласованияОФК.Найти(ТипЗнч(Док)));     			
			//Если не СтрокаСтатуса = Неопределено и не ТипДок = Неопределено Тогда
			//	Отказ = Отказ или не СтрокаСтатуса = СтатусДока	или ТипДок <> ТипЗнч(Док);
			//КонецЕсли;
			//СтрокаСтатуса = СтатусДока; 
			//ТипДок = ТипЗнч(Док);
		КонецЕсли;
		
	КонецЦикла;
	

	//Если Отказ Тогда
	//	Сообщить("Выбранные документы имеют разный статус или тип.
	//	|Для группового изменения статуса нужно выбрать документы одного статуса или типа.",СтатусСообщения.Важное); 		
	//	Возврат;	
	//КонецЕсли;	
	
	Если не ЗначениеЗаполнено(СписокДокументов) Тогда	
		Сообщить("Статусы документов нельзя изменить в списке!",СтатусСообщения.Информация);
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусСпискаДокументов(СписокДокументов,ПричинаИзмененияСтатуса,НовыйСтатус)
	
	Для Каждого СтрокаДокументов Из СписокДокументов Цикл
				
		// Изменим текущий статус		
		ДокументСсылка = СтрокаДокументов.ПервичныйДокумент;  
		Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
			Продолжить;
		КонецЕсли;	
		
		ДокументОбъект 			    = ДокументСсылка.ПолучитьОбъект();
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаПоступления")
			или ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
			ДокументОбъект.абс_СтатусДокумента   = НовыйСтатус; 
		Иначе
			ДокументОбъект.абс_Статус            = НовыйСтатус;
		КонецЕсли;		
		  		
		Попытка 
			Если НовыйСтатус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка 
				или НовыйСтатус = Перечисления.абс_СтатусыПервичныхДокументов.Отмена
				или НовыйСтатус = Перечисления.абс_СтатусыПервичныхДокументов.Отказ Тогда
				ДокументОбъект.Записать();  			
			Иначе
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			КонецЕсли;
			Сообщить("Первичный документ: " + ДокументСсылка + " переведен в статус " + НовыйСтатус + ".");
		Исключение			
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Первичный документ: " + ДокументСсылка + ": не удалось установить статус " + НовыйСтатус + ".");
		КонецПопытки;
		
	КонецЦикла;	 	
	  	
КонецПроцедуры


//Процедура из ПТУ
&НаСервере
Процедура ЗаполнитьСписокДоступныхСтатусов(знач Документ,СписокСтатусов = Неопределено, ВклСогласование = Ложь)
	
	Если СписокСтатусов = Неопределено Тогда
		СписокСтатусов = Новый СписокЗначений();
	Иначе
		СписокСтатусов.Очистить();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПоступления")
		или ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ТекСтатус = Документ.абс_СтатусДокумента;
	Иначе
		ТекСтатус = Документ.абс_Статус;
	КонецЕсли;	
	
	Если ТекСтатус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Тогда
		
		Если (НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СотрудникСклада) 				= Неопределено) ИЛИ
			 (НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СотрудникИнициаторКомпании) = Неопределено) Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отмена);
		КонецЕсли;
				
		Если (НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.РуководительОФК) = Неопределено) Тогда	
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отказ);		
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.ОбработкаБухгалтером);
			Если НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СогласованиеБухгалтером) = Неопределено Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.ДокументыПринятыБухгалтером);
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Завершен);	
			КонецЕсли;	
		КонецЕсли;
						
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыПервичныхДокументов.СогласованиеОФК и ВклСогласование Тогда  		
		Если (НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.РуководительОФК) = Неопределено) Тогда			
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.ОбработкаБухгалтером);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.УточнениеОФК);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отказ);
			Если НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СогласованиеБухгалтером) = Неопределено Тогда
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.ДокументыПринятыБухгалтером);
				СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Завершен);
			КонецЕсли;			
		КонецЕсли;		
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыПервичныхДокументов.ОбработкаБухгалтером Тогда
		Если НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СогласованиеБухгалтером) = Неопределено Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.ДокументыПринятыБухгалтером);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Завершен);
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыПервичныхДокументов.ДокументыПринятыБухгалтером Тогда
		Если НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СогласованиеБухгалтером) = Неопределено Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.УточнениеБухгалтерией);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отказ);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Завершен);
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыПервичныхДокументов.Завершен Тогда
		Если НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СогласованиеБухгалтером) = Неопределено ИЛИ
			 НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.КорректировкаДокумента);
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыПервичныхДокументов.КорректировкаДокумента Тогда
		Если НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СогласованиеБухгалтером) = Неопределено ИЛИ
			 НЕ мРолиПользователя.НайтиПоЗначению(Справочники.РолиИсполнителей.СуперПользователь) = Неопределено Тогда
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Завершен);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.УточнениеБухгалтерией);
			СписокСтатусов.Добавить(Перечисления.абс_СтатусыПервичныхДокументов.Отмена);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтатус1(Команда)
	СменитьСтатус();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мТекущийПользователь 	= глЗначениеПеременной("глТекущийПользователь");
	мРолиПользователя.ЗагрузитьЗначения(абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь));
    
КонецПроцедуры
